pipe-icoFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    upperPatch
    {
        type            patch;
        nFaces          22728;
        startFace       2437200;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          55956;
        startFace       2459928;
    }
    bottomPatch
    {
        type            patch;
        nFaces          25068;
        startFace       2515884;
    }
)

// ************************************************************************* //
